app/Models/PaperModel.php

    public function search($keyword = "", $limit = 10, $offset = 0)
    {
        $flag = 0;
        $prev_symbol = "";
        while ($keyword != trim($keyword, "|+ "))
        {
            $keyword = trim($keyword, "|+ ");
        }
        $keyword .= "|";
        for ($i = 0; $i < strlen($keyword); $i++)
        {
            if ($keyword[$i] == "|" | $keyword[$i] == "+")
            {
                $kw = trim(substr($keyword, $flag, $i - $flag));
                if ($prev_symbol == "|")
                {
//                    echo "OR", $kw;
                    $this->orLike('title', $kw);
                    $this->orLike('abstract', $kw);
                } else {
//                    echo $kw;
                    $this->Like('title', $kw);
                    $this->orLike('abstract', $kw);
                }
                $prev_symbol = $keyword[$i];
                $flag = $i + 1;
            }
        }
//        return $this->orWhere(['id' => $keyword])->first();
        $counts = $this->orderBy('year', 'desc')->countAllResults(false);
        return ["code" => 0,
            "rows" => $this->orderBy('year', 'desc')->findAll($limit, $offset),
            "total" => $counts];
---
SELECT COUNT(*) AS `numrows`
FROM `paper`
SELECT *
FROM `paper`
ORDER BY `year` DESC
 LIMIT 10, 10

    public function abstract($id = 0)
    {
        return $this->select('title, abstract')->where('id', $id)->first();
---
SELECT `title`, `abstract`
FROM `paper`
WHERE `id` = '7955'
 LIMIT 1